  #Напишите программу, которая будет преобразовывать десятичное число в двоичное.
    #Пример:

#- 45 -> 101101
#- 3 -> 11
#- 2 -> 10



numb= input('десятичное число ')
numb= int(numb)
a=bin(numb)
print(a)









